particle-iot/device-os/hal/src/stm32f2xx/usart_hal.c
/******************************************************************************
 * @file    usart_hal.c
 * @author  Satish Nair, Brett Walach
 * @version V1.0.0
 * @date    17-Dec-2014
 * @brief
 ******************************************************************************/
/*
 * Copyright (c) 2020 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHAN'TABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

/* Includes ------------------------------------------------------------------*/
#include "usart_hal.h"
#include "pinmap_hal.h"
#include "pinmap_impl.h"
#include "gpio_hal.h"
#include "stm32f2xx.h"
#include <string.h>
#include "interrupts_hal.h"
#include "check.h"
#include "system_error.h"

/* Private typedef -----------------------------------------------------------*/
typedef enum usart_ports {
    USART_TX_RX = 0,
    USART_RGBG_RGBB = 1
#if PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION
    ,USART_TXD_UC_RXD_UC = 2
    ,USART_C3_C2 = 3
    ,USART_C1_C0 = 4
#endif // PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION
} usart_ports;

/* Private macro -------------------------------------------------------------*/
#define USE_USART3_HARDWARE_FLOW_CONTROL_RTS_CTS 0  //Enabling this => 1 is not working at present

typedef struct usart_config {
    uint32_t baud_rate;
    uint32_t config;
} usart_config;

/* Private variables ---------------------------------------------------------*/
typedef struct stm32_usart_info {
    USART_TypeDef* usart_peripheral;

    __IO uint32_t* usart_apbReg;
    uint32_t usart_clock_en;

    int32_t usart_int_n;

    uint16_t usart_tx_pin;
    uint16_t usart_rx_pin;

    uint8_t usart_tx_pinsource;
    uint8_t usart_rx_pinsource;

    uint8_t usart_af_map;

    uint8_t usart_cts_pin;
    uint8_t usart_rts_pin;

    // Buffer pointers. These need to be global for IRQ handler access
    Ring_Buffer* usart_tx_buffer;
    Ring_Buffer* usart_rx_buffer;

    bool usart_configured;
    volatile bool usart_enabled;
    volatile bool usart_suspended;
    bool usart_transmitting;

    usart_config conf;
} stm32_usart_info;

/*
 * USART mapping
 */
stm32_usart_info USART_MAP[TOTAL_USARTS] = {
    /*
     * USART_peripheral (USARTx/UARTx; not using others)
     * clock control register (APBxENR)
     * clock enable bit value (RCC_APBxPeriph_USARTx/RCC_APBxPeriph_UARTx)
     * interrupt number (USARTx_IRQn/UARTx_IRQn)
     * TX pin
     * RX pin
     * TX pin source
     * RX pin source
     * GPIO AF map (GPIO_AF_USARTx/GPIO_AF_UARTx)
     * CTS pin
     * RTS pin
     * <tx_buffer pointer> used internally and does not appear below
     * <rx_buffer pointer> used internally and does not appear below
     * <usart enabled> used internally and does not appear below
     * <usart transmitting> used internally and does not appear below
     */
    { USART1,  &RCC->APB2ENR, RCC_APB2Periph_USART1, USART1_IRQn, TX,     RX,     GPIO_PinSource9,  GPIO_PinSource10, GPIO_AF_USART1 }, // USART 1
    { USART2,  &RCC->APB1ENR, RCC_APB1Periph_USART2, USART2_IRQn, RGBG,   RGBB,   GPIO_PinSource2,  GPIO_PinSource3,  GPIO_AF_USART2, A7,     RGBR } // USART 2
#if PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION
    ,{ USART3, &RCC->APB1ENR, RCC_APB1Periph_USART3, USART3_IRQn, TXD_UC, RXD_UC, GPIO_PinSource10, GPIO_PinSource11, GPIO_AF_USART3, CTS_UC, RTS_UC } // USART 3
    ,{ UART4,  &RCC->APB1ENR, RCC_APB1Periph_UART4,  UART4_IRQn,  C3,     C2,     GPIO_PinSource10, GPIO_PinSource11, GPIO_AF_UART4 } // UART 4
    ,{ UART5,  &RCC->APB1ENR, RCC_APB1Periph_UART5,  UART5_IRQn,  C1,     C0,     GPIO_PinSource12, GPIO_PinSource2,  GPIO_AF_UART5 } // UART 5
#endif // PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION
};

static USART_InitTypeDef usartInitStructure;
static stm32_usart_info *usartMap[TOTAL_USARTS]; // pointer to USART_MAP[] containing USART peripheral register locations (etc)

/* Private function prototypes -----------------------------------------------*/
inline void storeChar(uint16_t c, Ring_Buffer *buffer) __attribute__((always_inline));
inline void storeChar(uint16_t c, Ring_Buffer *buffer) {
    unsigned i = (unsigned int)(buffer->head + 1) % SERIAL_BUFFER_SIZE;

    if (i != buffer->tail) {
        buffer->buffer[buffer->head] = c;
        buffer->head = i;
    }
}

static uint8_t calculateWordLength(uint32_t config, uint8_t noparity);
static uint32_t calculateDataBitsMask(uint32_t config);
static uint8_t validateConfig(uint32_t config);
static void configureTransmitReceive(HAL_USART_Serial serial, uint8_t transmit, uint8_t receive);
static void configurePinsMode(HAL_USART_Serial serial, uint32_t config);
static void usartEndImpl(HAL_USART_Serial serial, bool cache);

uint8_t calculateWordLength(uint32_t config, uint8_t noparity) {
    // STM32F2 USARTs support only 8-bit or 9-bit communication, however
    // the parity bit is included in the total word length, so for 8E1 mode
    // the total word length would be 9 bits.
    uint8_t wlen = 0;
    switch (config & SERIAL_DATA_BITS) {
        case SERIAL_DATA_BITS_7: {
            wlen += 7;
            break;
        }
        case SERIAL_DATA_BITS_8: {
            wlen += 8;
            break;
        }
        case SERIAL_DATA_BITS_9: {
            wlen += 9;
            break;
        }
    }

    if ((config & SERIAL_PARITY) && !noparity) {
        wlen++;
    }

    if (wlen > 9 || wlen < (noparity ? 7 : 8)) {
        wlen = 0;
    }

    return wlen;
}

uint32_t calculateDataBitsMask(uint32_t config) {
    return (1 << calculateWordLength(config, 1)) - 1;
}

uint8_t validateConfig(uint32_t config) {
    // Total word length should be either 8 or 9 bits
    if (calculateWordLength(config, 0) == 0) {
        return 0;
    }
    // Either No, Even or Odd parity
    if ((config & SERIAL_PARITY) == (SERIAL_PARITY_EVEN | SERIAL_PARITY_ODD)) {
        return 0;
    }
    if ((config & SERIAL_HALF_DUPLEX) && (config & LIN_MODE)) {
        return 0;
    }

    if (config & LIN_MODE) {
        // Either Master or Slave mode
        // Break detection can still be enabled in both Master and Slave modes
        if ((config & LIN_MODE_MASTER) && (config & LIN_MODE_SLAVE)) {
            return 0;
        }
        switch (config & LIN_BREAK_BITS) {
            case LIN_BREAK_13B:
            case LIN_BREAK_10B:
            case LIN_BREAK_11B: {
                break;
            }
            default: {
                return 0;
            }
        }
    }

    return 1;
}

void configureTransmitReceive(HAL_USART_Serial serial, uint8_t transmit, uint8_t receive) {
    uint32_t toset = 0;
    if (transmit) {
        toset |= ((uint32_t)USART_CR1_TE);
    }
    if (receive) {
        toset |= ((uint32_t)USART_CR1_RE);
    }
    uint32_t tmp = usartMap[serial]->usart_peripheral->CR1;
    if ((tmp & ((uint32_t)(USART_CR1_TE | USART_CR1_RE))) != toset) {
        tmp &= ~((uint32_t)(USART_CR1_TE | USART_CR1_RE));
        tmp |= toset;
        usartMap[serial]->usart_peripheral->CR1 = tmp;
    }
}

