particle-iot/device-os/hal/src/stm32f2xx/usart_hal.c
void configurePinsMode(HAL_USART_Serial serial, uint32_t config) {
    if ((config & SERIAL_HALF_DUPLEX) == 0) {
        // Full duplex with push-pull
        HAL_Pin_Mode(usartMap[serial]->usart_rx_pin, AF_OUTPUT_PUSHPULL);
        HAL_Pin_Mode(usartMap[serial]->usart_tx_pin, AF_OUTPUT_PUSHPULL);
    } else if ((config & SERIAL_OPEN_DRAIN)) {
        // Half-duplex with open drain
        HAL_Pin_Mode(usartMap[serial]->usart_rx_pin, INPUT);
        HAL_Pin_Mode(usartMap[serial]->usart_tx_pin, AF_OUTPUT_DRAIN);
    } else {
        // Half-duplex with push-pull
        /* RM0033 24.3.10:
         * The TX pin is always released when no data is transmitted. Thus, it acts as a standard
         * I/O in idle or in reception. It means that the I/O must be configured so that TX is
         * configured as floating input (or output high open-drain) when not driven by the USART
         */
        HAL_Pin_Mode(usartMap[serial]->usart_rx_pin, INPUT);
        HAL_Pin_Mode(usartMap[serial]->usart_tx_pin, AF_OUTPUT_PUSHPULL);
        if (config & SERIAL_TX_PULL_UP) {
            // We ought to allow enabling pull-up or pull-down through HAL somehow
            Hal_Pin_Info* PIN_MAP = HAL_Pin_Map();
            pin_t gpio_pin = PIN_MAP[usartMap[serial]->usart_tx_pin].gpio_pin;
            GPIO_TypeDef *gpio_port = PIN_MAP[usartMap[serial]->usart_tx_pin].gpio_peripheral;
            GPIO_InitTypeDef GPIO_InitStructure = {0};
            GPIO_InitStructure.GPIO_Pin = gpio_pin;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
            GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
            GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
            GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
            GPIO_Init(gpio_port, &GPIO_InitStructure);
        }
    }
}

void usartEndImpl(HAL_USART_Serial serial, bool cache) {
    // Wait for transmission of outgoing data
    while (usartMap[serial]->usart_tx_buffer->head != usartMap[serial]->usart_tx_buffer->tail);

    // Disable the USART
    USART_Cmd(usartMap[serial]->usart_peripheral, DISABLE);

    // Switch pins to INPUT
    HAL_Pin_Mode(usartMap[serial]->usart_rx_pin, INPUT);
    HAL_Pin_Mode(usartMap[serial]->usart_tx_pin, INPUT);

    // Disable LIN mode
    USART_LINCmd(usartMap[serial]->usart_peripheral, DISABLE);

    // Deinitialise USART
    USART_DeInit(usartMap[serial]->usart_peripheral);

    // Disable USART Receive and Transmit interrupts
    USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_RXNE, DISABLE);
    USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_TXE, DISABLE);

    NVIC_InitTypeDef NVIC_InitStructure;

    // Disable the USART Interrupt
    NVIC_InitStructure.NVIC_IRQChannel = usartMap[serial]->usart_int_n;
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;

    NVIC_Init(&NVIC_InitStructure);

    // Disable USART Clock
    *usartMap[serial]->usart_apbReg &= ~usartMap[serial]->usart_clock_en;

    if (!cache) {
        // clear any received data
        usartMap[serial]->usart_rx_buffer->head = usartMap[serial]->usart_rx_buffer->tail;
        // Undo any pin re-mapping done for this USART
        // ...
        memset(usartMap[serial]->usart_rx_buffer, 0, sizeof(Ring_Buffer));
    }

    memset(usartMap[serial]->usart_tx_buffer, 0, sizeof(Ring_Buffer));

    usartMap[serial]->usart_enabled = false;
    usartMap[serial]->usart_transmitting = false;
}

void hal_usart_init(HAL_USART_Serial serial, Ring_Buffer *rx_buffer, Ring_Buffer *tx_buffer) {
    usartMap[serial]->usart_configured = false;

    if (serial == HAL_USART_SERIAL1) {
        usartMap[serial] = &USART_MAP[USART_TX_RX];
    } else if (serial == HAL_USART_SERIAL2) {
        usartMap[serial] = &USART_MAP[USART_RGBG_RGBB];
    }
#if PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION
    else if (serial == HAL_USART_SERIAL3) {
        usartMap[serial] = &USART_MAP[USART_TXD_UC_RXD_UC];
    } else if (serial == HAL_USART_SERIAL4) {
        usartMap[serial] = &USART_MAP[USART_C3_C2];
    } else if (serial == HAL_USART_SERIAL5) {
        usartMap[serial] = &USART_MAP[USART_C1_C0];
    }
#endif // PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION

    usartMap[serial]->usart_rx_buffer = rx_buffer;
    usartMap[serial]->usart_tx_buffer = tx_buffer;

    memset(usartMap[serial]->usart_rx_buffer, 0, sizeof(Ring_Buffer));
    memset(usartMap[serial]->usart_tx_buffer, 0, sizeof(Ring_Buffer));

    usartMap[serial]->usart_enabled = false;
    usartMap[serial]->usart_transmitting = false;

    usartMap[serial]->usart_configured = true;
}

void hal_usart_begin(HAL_USART_Serial serial, uint32_t baud) {
    hal_usart_begin_config(serial, baud, 0, 0); // Default serial configuration is 8N1
}

void hal_usart_begin_config(HAL_USART_Serial serial, uint32_t baud, uint32_t config, void *ptr) {
    if (!usartMap[serial]->usart_configured) {
        return;
    }
    // Verify UART configuration, exit if it's invalid.
    if (!validateConfig(config)) {
        usartMap[serial]->usart_enabled = false;
        return;
    }

    usartMap[serial]->usart_suspended = false;

    USART_DeInit(usartMap[serial]->usart_peripheral);

    usartMap[serial]->usart_enabled = false;

    configurePinsMode(serial, config);

    // Enable USART Clock
    *usartMap[serial]->usart_apbReg |=  usartMap[serial]->usart_clock_en;

    // Connect USART pins to AFx
    Hal_Pin_Info* PIN_MAP = HAL_Pin_Map();
    GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->usart_rx_pin].gpio_peripheral, usartMap[serial]->usart_rx_pinsource, usartMap[serial]->usart_af_map);
    GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->usart_tx_pin].gpio_peripheral, usartMap[serial]->usart_tx_pinsource, usartMap[serial]->usart_af_map);

    // NVIC Configuration
    NVIC_InitTypeDef NVIC_InitStructure;
    // Enable the USART Interrupt
    NVIC_InitStructure.NVIC_IRQChannel = usartMap[serial]->usart_int_n;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 7;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    // USART default configuration
    // USART configured as follow:
    // - BaudRate = (set baudRate as 9600 baud)
    // - Word Length = 8 Bits
    // - One Stop Bit
    // - No parity
    // - Hardware flow control disabled for Serial1/2/4/5
    // - Hardware flow control enabled (RTS and CTS signals) for Serial3
    // - Receive and transmit enabled
    // USART configuration
    usartInitStructure.USART_BaudRate = baud;
    usartInitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

    // Flow control configuration
    switch (config & SERIAL_FLOW_CONTROL) {
        case SERIAL_FLOW_CONTROL_CTS: {
            usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_CTS;
            break;
        }
        case SERIAL_FLOW_CONTROL_RTS: {
            usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS;
            break;
        }
        case SERIAL_FLOW_CONTROL_RTS_CTS: {
            usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
            break;
        }
        case SERIAL_FLOW_CONTROL_NONE:
        default: {
            usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
            break;
        }
    }

    if (serial == HAL_USART_SERIAL1) {
        // USART1 supports hardware flow control, but RTS and CTS pins are not exposed
        usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    }

#if PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION
    if (serial == HAL_USART_SERIAL4 || serial == HAL_USART_SERIAL5) {
        // UART4 and UART5 do not support hardware flow control
        usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    }
#endif // PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION

#if USE_USART3_HARDWARE_FLOW_CONTROL_RTS_CTS    // Electron
    if (serial == HAL_USART_SERIAL3) {
        usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
    }
#endif

