particle-iot/device-os/hal/src/stm32f2xx/usart_hal.c
    switch (usartInitStructure.USART_HardwareFlowControl) {
        case USART_HardwareFlowControl_CTS: {
            HAL_Pin_Mode(usartMap[serial]->usart_cts_pin, AF_OUTPUT_PUSHPULL);
            GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->usart_cts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->usart_cts_pin].gpio_pin_source, usartMap[serial]->usart_af_map);
            break;
        }
        case USART_HardwareFlowControl_RTS: {
            HAL_Pin_Mode(usartMap[serial]->usart_rts_pin, AF_OUTPUT_PUSHPULL);
            GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->usart_rts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->usart_rts_pin].gpio_pin_source, usartMap[serial]->usart_af_map);
            break;
        }
        case USART_HardwareFlowControl_RTS_CTS: {
            HAL_Pin_Mode(usartMap[serial]->usart_cts_pin, AF_OUTPUT_PUSHPULL);
            HAL_Pin_Mode(usartMap[serial]->usart_rts_pin, AF_OUTPUT_PUSHPULL);
            GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->usart_cts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->usart_cts_pin].gpio_pin_source, usartMap[serial]->usart_af_map);
            GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->usart_rts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->usart_rts_pin].gpio_pin_source, usartMap[serial]->usart_af_map);
            break;
        }
        case USART_HardwareFlowControl_None:
        default: {
            break;
        }
    }

    // Stop bit configuration.
    switch (config & SERIAL_STOP_BITS) {
        case SERIAL_STOP_BITS_1: { // 1 stop bit
            usartInitStructure.USART_StopBits = USART_StopBits_1;
            break;
        }
        case SERIAL_STOP_BITS_2: { // 2 stop bits
            usartInitStructure.USART_StopBits = USART_StopBits_2;
            break;
        }
        case SERIAL_STOP_BITS_0_5: { // 0.5 stop bits
            usartInitStructure.USART_StopBits = USART_StopBits_0_5;
            break;
        }
        case SERIAL_STOP_BITS_1_5: { // 1.5 stop bits
            usartInitStructure.USART_StopBits = USART_StopBits_1_5;
            break;
        }
        default: {
            break;
        }
    }

    // Data bits configuration
    switch (calculateWordLength(config, 0)) {
        case 8: {
            usartInitStructure.USART_WordLength = USART_WordLength_8b;
            break;
        }
        case 9: {
            usartInitStructure.USART_WordLength = USART_WordLength_9b;
            break;
        }
        default: {
            break;
        }
    }

    // Parity configuration
    switch (config & SERIAL_PARITY) {
        case SERIAL_PARITY_NO: {
            usartInitStructure.USART_Parity = USART_Parity_No;
            break;
        }
        case SERIAL_PARITY_EVEN: {
            usartInitStructure.USART_Parity = USART_Parity_Even;
            break;
        }
        case SERIAL_PARITY_ODD: {
            usartInitStructure.USART_Parity = USART_Parity_Odd;
            break;
        }
        default: {
            break;
        }
    }

    // Disable LIN mode just in case
    USART_LINCmd(usartMap[serial]->usart_peripheral, DISABLE);

    // Configure USART
    USART_Init(usartMap[serial]->usart_peripheral, &usartInitStructure);

    // LIN configuration
    if (config & LIN_MODE) {
        // Enable break detection
        switch (config & LIN_BREAK_BITS) {
            case LIN_BREAK_10B: {
                USART_LINBreakDetectLengthConfig(usartMap[serial]->usart_peripheral, USART_LINBreakDetectLength_10b);
                break;
            }
            case LIN_BREAK_11B: {
                USART_LINBreakDetectLengthConfig(usartMap[serial]->usart_peripheral, USART_LINBreakDetectLength_11b);
                break;
            }
            default: {
                break;
            }
        }
    }

    usartMap[serial]->conf.baud_rate = baud;
    usartMap[serial]->conf.config = config;
    if (config & SERIAL_HALF_DUPLEX) {
        hal_usart_half_duplex(serial, ENABLE);
    }

    USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_TC, DISABLE);

    // Enable the USART
    USART_Cmd(usartMap[serial]->usart_peripheral, ENABLE);

    if (config & LIN_MODE) {
        USART_LINCmd(usartMap[serial]->usart_peripheral, ENABLE);
    }

    usartMap[serial]->usart_enabled = true;
    usartMap[serial]->usart_transmitting = false;

    // Enable USART Receive and Transmit interrupts
    USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_TXE, ENABLE);
    USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_RXNE, ENABLE);
}

void hal_usart_end(HAL_USART_Serial serial) {
    usartMap[serial]->usart_suspended = true;
    usartEndImpl(serial, false);
}

uint32_t hal_usart_write(HAL_USART_Serial serial, uint8_t data) {
    return hal_usart_write_nine_bits(serial, data);
}

uint32_t hal_usart_write_nine_bits(HAL_USART_Serial serial, uint16_t data) {
    // Remove any bits exceeding data bits configured
    data &= calculateDataBitsMask(usartMap[serial]->conf.config);
    // interrupts are off and data in queue;
    if ((USART_GetITStatus(usartMap[serial]->usart_peripheral, USART_IT_TXE) == RESET)
        && usartMap[serial]->usart_tx_buffer->head != usartMap[serial]->usart_tx_buffer->tail) {
        // Get him busy
        USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_TXE, ENABLE);
    }

    unsigned i = (usartMap[serial]->usart_tx_buffer->head + 1) % SERIAL_BUFFER_SIZE;

    // If the output buffer is full, there's nothing for it other than to
    // wait for the interrupt handler to empty it a bit
    // no space so or Called Off Panic with interrupt off get the message out!
    // make space Enter Polled IO mode
    while (i == usartMap[serial]->usart_tx_buffer->tail || ((__get_PRIMASK() & 1) && usartMap[serial]->usart_tx_buffer->head != usartMap[serial]->usart_tx_buffer->tail) ) {
        // Interrupts are on but they are not being serviced because this was called from a higher
        // Priority interrupt
        if (USART_GetITStatus(usartMap[serial]->usart_peripheral, USART_IT_TXE) && USART_GetFlagStatus(usartMap[serial]->usart_peripheral, USART_FLAG_TXE)) {
            // protect for good measure
            USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_TXE, DISABLE);
            // Write out a byte
            USART_SendData(usartMap[serial]->usart_peripheral,  usartMap[serial]->usart_tx_buffer->buffer[usartMap[serial]->usart_tx_buffer->tail++]);
            usartMap[serial]->usart_tx_buffer->tail %= SERIAL_BUFFER_SIZE;
            // unprotect
            USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_TXE, ENABLE);
        }
    }

    usartMap[serial]->usart_tx_buffer->buffer[usartMap[serial]->usart_tx_buffer->head] = data;
    usartMap[serial]->usart_tx_buffer->head = i;
    usartMap[serial]->usart_transmitting = true;
    USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_TXE, ENABLE);

    return 1;
}

