particle-iot/device-os/hal/src/stm32f2xx/usart_hal.c
int32_t hal_usart_available(HAL_USART_Serial serial) {
    return (unsigned int)(SERIAL_BUFFER_SIZE + usartMap[serial]->usart_rx_buffer->head - usartMap[serial]->usart_rx_buffer->tail) % SERIAL_BUFFER_SIZE;
}

int32_t hal_usart_available_data_for_write(HAL_USART_Serial serial) {
    int32_t tail = usartMap[serial]->usart_tx_buffer->tail;
    int32_t available = SERIAL_BUFFER_SIZE - (usartMap[serial]->usart_tx_buffer->head >= tail ?
                                              usartMap[serial]->usart_tx_buffer->head - tail :
                                              (SERIAL_BUFFER_SIZE + usartMap[serial]->usart_tx_buffer->head - tail) - 1);

    return available;
}


int32_t hal_usart_read(HAL_USART_Serial serial) {
    // if the head isn't ahead of the tail, we don't have any characters
    if (usartMap[serial]->usart_rx_buffer->head == usartMap[serial]->usart_rx_buffer->tail) {
        return -1;
    } else {
        uint16_t c = usartMap[serial]->usart_rx_buffer->buffer[usartMap[serial]->usart_rx_buffer->tail];
        usartMap[serial]->usart_rx_buffer->tail = (unsigned int)(usartMap[serial]->usart_rx_buffer->tail + 1) % SERIAL_BUFFER_SIZE;
        return c;
    }
}

int32_t hal_usart_peek(HAL_USART_Serial serial) {
    if (usartMap[serial]->usart_rx_buffer->head == usartMap[serial]->usart_rx_buffer->tail) {
        return -1;
    } else {
        return usartMap[serial]->usart_rx_buffer->buffer[usartMap[serial]->usart_rx_buffer->tail];
    }
}

void hal_usart_flush(HAL_USART_Serial serial) {
    // Loop until USART DR register is empty
    while ( usartMap[serial]->usart_tx_buffer->head != usartMap[serial]->usart_tx_buffer->tail );
    // Loop until last frame transmission complete
    while (usartMap[serial]->usart_transmitting && (USART_GetFlagStatus(usartMap[serial]->usart_peripheral, USART_FLAG_TC) == RESET));
    usartMap[serial]->usart_transmitting = false;
}

bool hal_usart_is_enabled(HAL_USART_Serial serial) {
    return usartMap[serial]->usart_enabled;
}

void hal_usart_half_duplex(HAL_USART_Serial serial, bool enable) {
    if (hal_usart_is_enabled(serial)) {
        USART_Cmd(usartMap[serial]->usart_peripheral, DISABLE);
    }

    if (enable) {
        usartMap[serial]->conf.config |= SERIAL_HALF_DUPLEX;
    } else {
        usartMap[serial]->conf.config &= ~(SERIAL_HALF_DUPLEX);
    }
    configurePinsMode(serial, usartMap[serial]->conf.config);

    // These bits need to be cleared according to the reference manual
    usartMap[serial]->usart_peripheral->CR2 &= ~(USART_CR2_LINEN | USART_CR2_CLKEN);
    usartMap[serial]->usart_peripheral->CR3 &= ~(USART_CR3_IREN | USART_CR3_SCEN);
    USART_HalfDuplexCmd(usartMap[serial]->usart_peripheral, enable ? ENABLE : DISABLE);


    if (hal_usart_is_enabled(serial)) {
        USART_Cmd(usartMap[serial]->usart_peripheral, ENABLE);
    }
}

void hal_usart_send_break(HAL_USART_Serial serial, void* reserved) {
    int32_t state = HAL_disable_irq();
    while((usartMap[serial]->usart_peripheral->CR1 & USART_CR1_SBK) == SET);
    USART_SendBreak(usartMap[serial]->usart_peripheral);
    while((usartMap[serial]->usart_peripheral->CR1 & USART_CR1_SBK) == SET);
    HAL_enable_irq(state);
}

uint8_t hal_usart_break_detected(HAL_USART_Serial serial) {
    if (USART_GetFlagStatus(usartMap[serial]->usart_peripheral, USART_FLAG_LBD)) {
        // Clear LBD flag
        USART_ClearFlag(usartMap[serial]->usart_peripheral, USART_FLAG_LBD);
        return 1;
    }
    return 0;
}

// Shared Interrupt Handler for USART2/Serial1 and USART1/Serial2
// WARNING: This function MUST remain reentrance compliant -- no local static variables etc.
static void usartIntHandler(HAL_USART_Serial serial) {
    if (USART_GetITStatus(usartMap[serial]->usart_peripheral, USART_IT_RXNE) != RESET) {
        // Read byte from the receive data register
        uint16_t c = USART_ReceiveData(usartMap[serial]->usart_peripheral);
        // Remove parity bits from data
        c &= calculateDataBitsMask(usartMap[serial]->conf.config);
        storeChar(c, usartMap[serial]->usart_rx_buffer);
    }

    uint8_t noecho = (usartMap[serial]->conf.config & (SERIAL_HALF_DUPLEX | SERIAL_HALF_DUPLEX_NO_ECHO)) == (SERIAL_HALF_DUPLEX | SERIAL_HALF_DUPLEX_NO_ECHO);

    if (USART_GetITStatus(usartMap[serial]->usart_peripheral, USART_IT_TC) != RESET) {
        if (noecho) {
            USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_TC, DISABLE);
            configureTransmitReceive(serial, 0, 1);
        }
    }

    if (USART_GetITStatus(usartMap[serial]->usart_peripheral, USART_IT_TXE) != RESET) {
        // Write byte to the transmit data register
        if (usartMap[serial]->usart_tx_buffer->head == usartMap[serial]->usart_tx_buffer->tail) {
            // Buffer empty, so disable the USART Transmit interrupt
            USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_TXE, DISABLE);
            if (noecho) {
                USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_TC, ENABLE);
            }
        } else {
            if (noecho) {
                configureTransmitReceive(serial, 1, 0);
            }
            // There is more data in the output buffer. Send the next byte
            USART_SendData(usartMap[serial]->usart_peripheral, usartMap[serial]->usart_tx_buffer->buffer[usartMap[serial]->usart_tx_buffer->tail++]);
            usartMap[serial]->usart_tx_buffer->tail %= SERIAL_BUFFER_SIZE;
        }
    }

    if (USART_GetFlagStatus(usartMap[serial]->usart_peripheral, USART_FLAG_ORE) != RESET) {
        // If Overrun flag is still set, clear it
        (void)USART_ReceiveData(usartMap[serial]->usart_peripheral);
    }
}

int hal_usart_sleep(HAL_USART_Serial serial, bool sleep, void* reserved) {
    if (sleep) {
        CHECK_TRUE(usartMap[serial]->usart_enabled, SYSTEM_ERROR_NONE);
        CHECK_FALSE(usartMap[serial]->usart_suspended, SYSTEM_ERROR_NONE);
        usartMap[serial]->usart_suspended = true;
        hal_usart_flush(serial);
        usartEndImpl(serial, true);
    } else {
        CHECK_TRUE(usartMap[serial]->usart_configured, SYSTEM_ERROR_INVALID_STATE);
        CHECK_TRUE(usartMap[serial]->usart_suspended, SYSTEM_ERROR_NONE);
        hal_usart_begin_config(serial, usartMap[serial]->conf.baud_rate, usartMap[serial]->conf.config, NULL);
    }
    return SYSTEM_ERROR_NONE;
}

// Serial1 interrupt handler
/*******************************************************************************
 * Function Name  : HAL_USART1_Handler
 * Description    : This function handles USART1 global interrupt request.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
void HAL_USART1_Handler(void) {
    usartIntHandler(HAL_USART_SERIAL1);
}

